In [92]:
import pandas as pd
import matplotlib.pyplot as plt

In [77]:
gender_submission = pd.read_csv('Data\gender_submission.csv')

In [78]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [79]:
gender_submission.shape

(418, 2)

In [80]:
test_data = pd.read_csv('test.csv')

In [81]:
test_data.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [82]:
test_data.shape

(418, 11)

In [83]:
test_data.PassengerId.dtype, gender_submission.PassengerId.dtype

(dtype('int64'), dtype('int64'))

In [84]:
# Merge 'test_data' and 'gender_submission' using a left join
all_data = pd.merge(left=test_data, right=gender_submission, left_on='PassengerId', right_on='PassengerId', how='left')

In [85]:
all_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [86]:
all_data.set_index('PassengerId').head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,0
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,1
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,0
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,0
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,1

In [87]:
print(all_data[all_data.Survived == 1].PassengerId.count())

152

In [88]:
print(all_data[all_data.Survived == 0].PassengerId.count())

266

In [89]:
all_data.groupby(['Survived','Sex']).count()

,,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,Sex,,,,,,,,,,
0,male,266,266,266,205,266,266,266,265,47,266
1,female,152,152,152,127,152,152,152,152,44,152

In [90]:
plec = all_data[['Survived','Sex']]
plec.head(5)

   Survived     Sex
0         0    male
1         1  female
2         0    male
3         0    male
4         1  female

In [91]:
plec[(plec['Survived'] == 0) & (plec['Sex']=='female')]

Empty DataFrame
Columns: [Survived, Sex]
Index: []